In [12]:
import pandas as pd

df = pd.read_csv('demo.csv')
print(df)

   ID         Name  Class  Math  Science  English
0   1  Ayesha Khan     10  89.0       92       85
1   2  Rahul Mehta     10   NaN       88       90
2   3   Simran Roy     10  95.0       91       87
3   4    Rohan Das     10  80.0       86       84
4   5   Neha Patel     10  76.0       90       88

In [3]:
df.tail(3)

   ID        Name  Class  Math  Science  English
2   3  Simran Roy     10    95       91       87
3   4   Rohan Das     10    80       86       84
4   5  Neha Patel     10    76       90       88

In [4]:
df.describe()

             ID  Class       Math    Science    English
count  5.000000    5.0   5.000000   5.000000   5.000000
mean   3.000000   10.0  83.600000  89.400000  86.800000
std    1.581139    0.0   8.080842   2.408319   2.387467
min    1.000000   10.0  76.000000  86.000000  84.000000
25%    2.000000   10.0  78.000000  88.000000  85.000000
50%    3.000000   10.0  80.000000  90.000000  87.000000
75%    4.000000   10.0  89.000000  91.000000  88.000000
max    5.000000   10.0  95.000000  92.000000  90.000000

In [6]:
df.dtypes

ID          int64
Name       object
Class       int64
Math        int64
Science     int64
English     int64
dtype: object

In [13]:
#handling missing values

df.isnull()

      ID   Name  Class   Math  Science  English
0  False  False  False  False    False    False
1  False  False  False   True    False    False
2  False  False  False  False    False    False
3  False  False  False  False    False    False
4  False  False  False  False    False    False

In [ ]:
df.isnull().any()  #axis=1 soo it will show 1 result corresponding to every index

ID         False
Name       False
Class      False
Math        True
Science    False
English    False
dtype: bool

In [15]:
df.isnull().sum()

ID         0
Name       0
Class      0
Math       1
Science    0
English    0
dtype: int64

In [ ]:
## filled the missing values 
##df.fillna(0)

#if we want to fill missing values with the mean of column

df['Filled'] =df['Math'].fillna(df['Math'].mean())

In [17]:
df

   ID         Name  Class  Math  Science  English  Filled
0   1  Ayesha Khan     10  89.0       92       85    89.0
1   2  Rahul Mehta     10   NaN       88       90    85.0
2   3   Simran Roy     10  95.0       91       87    95.0
3   4    Rohan Das     10  80.0       86       84    80.0
4   5   Neha Patel     10  76.0       90       88    76.0

In [18]:
#renaming column

df = df.rename(columns={'ID':'Unique ID'})
df

   Unique ID         Name  Class  Math  Science  English  Filled
0          1  Ayesha Khan     10  89.0       92       85    89.0
1          2  Rahul Mehta     10   NaN       88       90    85.0
2          3   Simran Roy     10  95.0       91       87    95.0
3          4    Rohan Das     10  80.0       86       84    80.0
4          5   Neha Patel     10  76.0       90       88    76.0

In [ ]:
#change datatypes using astype() function

In [24]:
#Data aggregation

grouped_by = df.groupby(['Unique ID','Name'])['Science'].sum()
print(grouped_by)

Unique ID  Name
1          Ayesha Khan    92
2          Rahul Mehta    88
3          Simran Roy     91
4          Rohan Das      86
5          Neha Patel     90
Name: Science, dtype: int64

In [ ]:
#aggregate multiple functions

##grouped_agg = df.groupby('Unique ID')['English'].agg(['mean','sum','count'])

In [27]:
df1 = pd.DataFrame({'Key':[2,4,5],'Values':['d','f','e']})
df2 = pd.DataFrame({'Key':[3,4,2],'Values':['w','f','d']})

In [28]:
df1

   Key Values
0    2      d
1    4      f
2    5      e

In [29]:
df2

   Key Values
0    3      w
1    4      f
2    2      d

In [30]:
#merge
pd.merge(df1,df2,on='Key',how='inner')

   Key Values_x Values_y
0    2        d        d
1    4        f        f

In [31]:
pd.merge(df1,df2,on='Key',how='outer')

   Key Values_x Values_y
0    2        d        d
1    3      NaN        w
2    4        f        f
3    5        e      NaN